#include "STC8.h"
/*
单片机执行频率为24M
8个通道均输出1khz
占空比从10%~80%
*/


void main(void)
{
	P_SW2 = 0X80;		//必须设置
	
	PWMCKS = 0X00;		//PWM时钟为系统时钟
	PWMC = 24000-1;		//设置PWM周期为24000个PWM时钟	注意此寄存器为15位	pwm频率 = 系统工作频率24M/（PWMC+1）
	//PWM0    P2.0	10%占空比
	PWM0T1 = 0;	//在计数值为0地方输出低电平
	PWM0T2 = ((24000-1)-((24000-1)*0.1));	//在计数值为19200地方输出高电平
	PWM0CR = 0X80;		//使能PWM0输出
	//PWM1	P2.1	20%占空比
	PWM1T1 = 0;	//在计数值为0地方输出低电平
	PWM1T2 = ((24000-1)-((24000-1)*0.2));	//在计数值为19200地方输出高电平
	PWM1CR = 0X80;		//使能PWM1输出
	//PWM2    P2.2	30%占空比
	PWM2T1 = 0;	//在计数值为0地方输出低电平
	PWM2T2 = ((24000-1)-((24000-1)*0.3));	//在计数值为19200地方输出高电平
	PWM2CR = 0X80;		//使能PWM2输出
	//PWM3	P2.3	40%占空比
	PWM3T1 = 0;	//在计数值为0地方输出低电平
	PWM3T2 = ((24000-1)-((24000-1)*0.4));	//在计数值为19200地方输出高电平
	PWM3CR = 0X80;		//使能PWM3输出
	//PWM4    P2.4	50%占空比
	PWM4T1 = 0;	//在计数值为0地方输出低电平
	PWM4T2 = ((24000-1)-((24000-1)*0.5));	//在计数值为19200地方输出高电平
	PWM4CR = 0X80;		//使能PWM4输出
	//PWM5	P2.5	60%占空比
	PWM5T1 = 0;	//在计数值为0地方输出低电平
	PWM5T2 = ((24000-1)-((24000-1)*0.6));	//在计数值为19200地方输出高电平
	PWM5CR = 0X80;		//使能PWM5输出
	//PWM6    P2.6	70%占空比
	PWM6T1 = 0;	//在计数值为0地方输出低电平
	PWM6T2 = ((24000-1)-((24000-1)*0.7));	//在计数值为19200地方输出高电平
	PWM6CR = 0X80;		//使能PWM6输出
	//PWM7	P2.7	80%占空比
	PWM7T1 = 0;	//在计数值为0地方输出低电平
	PWM7T2 = ((24000-1)-((24000-1)*0.8));	//在计数值为19200地方输出高电平
	PWM7CR = 0X80;		//使能PWM7输出
	
	P_SW2 = 0X00;
	
	//在使能PWM中此程序语句必须放在最后，具体原因请看手册547页
	PWMCR = 0X80;		//	启动PWM模块
	
	while(1);
}


